jorgebucaran/fisher
eldritch-theme/fish
meaningful-ooo/sponge
patrickf1/fzf.fish
halostatue/fish-utils-core
halostatue/fish-macos
joshmedeski/fish-lf-icons
jethrokuan/z
franciscolourenco/done
laughedelic/pisces
